a, b = 1, 5
print(f'Гловальное пространстров имен, где:\n a= {a}\n b= {b}')
print('a + b = ', a + b)


def test():  # простая функция
    a, b = 2, 2
    print(f'Локальное пространство имен в функции "test", где:  a= {a}  b= {b}')
    print('a + b = ', a + b)


def test2(a, b, z):  # принимающая функция с тремя параметрами
    print(f'Заданы параметры в функции "test2": a= {a} b= {b} z= {z}')
    print('a + b + z =', a + b + z)


print('\n**** Проверка вызова функции test ****'), test()

print('\n**** Проверка вызова функции test2 ****'), test2(40, 15, 90)

print(f'\nПроверка гловального пространстрва имен:\n a= {a}\n b= {b}')
